  {
    "tour": {
      "match_type": "purpose",
      "match": [
        [
          1,
          1
        ],
        [
          1,
          2
        ],
        [
          2,
          3
        ],
        [
          2,
          4
        ]
      ],
      "destination_country_id": "1",
      "purpose_id": "1",
      "accomodation_type_id": "1",
      "arrival_date": "09/10/2022",
      "departure_date": "14/10/2022",
      "passengers": "10",
      "partner": "CNH Tours",
      "contact_agent": "1",
      "rooms": "1s;16d;1t",
      "title": "ENCHANTING ECUADOR",
      "passengers": "18",
      "days": "10",
      "nights": "9",
      "valid_until": "31/12/2022",
      "description": "UNIQUE AND TRANSFORMATIONAL EXPERIENCES IN ECUADOR FOR CNH TRAVELS WE CREATED THIS TAILOR MADE TOUR WITH A FOCUS ON TRANSFORMATIONAL AND SUSTAINABLE TRAVEL. THIS PACKAGE IS BASED ON RESPONSIBLE TOURISM PRACTICES AS IT TOUCHES MANY ARTISANS AND ENTREPRENUERS IN THEIR CRAFTS FOLLOWING GUIDELINS OF FAIR PRICING."
    },
    "client": {
      "customer_type": "1",
      "legal_name": "British Bank",
      "contact_name": "Mr. Frank Stevens",
      "id_number": "15261548",
      "brith_date": "10/10/1950",
      "email": "frank.stevens@gmail.com",
      "client_id": "1"
    },
    "end_services": {
      "net_rates": [
        {
          "room_type": "single",
          "quantity": "16",
          "passengers": "16",
          "roh": "3794"
        },
        {
          "room_type": "double",
          "quantity": "1",
          "passengers": "2",
          "roh": "2279"
        }
      ],
      "included": [
        "Meals described in the tour",
        "Ticket UIO – CUE – UIO Economic Class",
        "Guidance",
        "Transportation",
        "16 single rooms and 1 double room",
        "Entrance Fees to churches and museums",
        "Activities with local entrepreneurs"
      ],
      "not_included": [
        "International Air tickets",
        "Alcoholic beverages ",
        "Gratuity/Tips",
        "Personal expenses (late check_out, gifts, etc.) ",
        "Meals not described in the program "
      ]
    },
    "destinations": [
      {
        "parent": 0,
        "destination_id": "1",
        "destination_name": "otavalo",
        "destination_title": "Otavalo",
        "hotel_id": "1",
        "airport_id": "1",
        "has_aiport": false,
        "description": "Otavalo, a beautiful ride in a pristine highway enjoying the beautiful landscapes of the Ecuadorian northern Andean mountain range. The city of Otavalo is located in the center of various indigenous communities, rich in culture and traditions, as well as some impressive and very important (for Ecuador’s ancestral cultures) volcanoes such as Imbabura, Cotacachi, Mojanda and Cusín",
        "previous": "",
        "next": "",
        "days": [
          {
            "parent": 0,
            "day_description": "day description",
            "day_name": "Day 1",
            "date": "MONDAY 25TH April 2022",
            "meals": "D/O",
            "option_id": "1",
            "day_observation": "Day 1: Overnight at Hotel Otavalo",
            "key_activity_id": "1",
            "description": "",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "24",
                "title": "Your arrival, welcome to Ecuador",
                "photo": "photo",
                "description": "Departure from Quito International Airport to Hotel Otavalo",
                "prevoius": "",
                "next": ""
              },
              {
                "experience_id": "2",
                "title": "arrive to your hotel, Hotel Otavalo",
                "photo": "photo",
                "description": "Check_in at Hotel Otavalo with our welcome cocktail. Dinner at our Sarance Restaurant. Sarance means “People who live upright” and it also is the ancient name of Otavalo.",
                "prevoius": "",
                "next": "Have a good night sleep, you are going to need it."
              }
            ]
          },
          {
            "parent": 1,
            "day_description": "We start the day visiting the province in a unique form.  We will experience the secrets of Imbabura. Imbabura is the province in which the fabulous ancestral knowledge of indigenous cultures are located. We will meet the safe keepers of this traditions that have dedicated their lives to keep their cultures alive.",
            "day_name": "Day 2",
            "date": "TUESDAY 26TH April 2022",
            "meals": "B/L/D/O",
            "option_id": "1",
            "day_observation": "Day 2: Overnight at Hotel Otavalo",
            "key_activity_id": "1",
            "description": "",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "3",
                "title": "Equator Face Workshop",
                "photo": "photo",
                "description": "In the community of La Compañía, by San Pablo Lake, visit a family dedicated to weaving on traditional looms. With skill and creativity they make girdles that differentiate the meaning of indigenous clothing through color and design; preserving this ancestral activity in their family tradition.",
                "previous": "Let's create some family bonds! This family has kept the traditions of the Taitas (fathers) through 4 generations.",
                "next": ""
              },
              {
                "experience_id": "4",
                "title": "Kawsaymi – Ancestral Gastronomy",
                "photo": "photo",
                "description": "Husband and wife team Claudia and Patricio, of a Kichwa Otavalean family, are dedicated to presenting experiences in ancestral gastronomy. Located in the Panecillo community, in the Parish of Quichinche, Canton Otavalo ‘Kawsaymi’ is Kichwa for “our living culture.” The word summarizes the family’s focus on promoting the original cuisine of their ancestry, and also presenting their customs to visitors in order to create playful, exciting, and one_of_a_kind experiences. Without a doubt, the gastronomy workshop is an original and unforgettable activity. It combines a variety of native flavors with the richness of natural products and their various preparation methods. In this typical home built with mud and terracotta, diverse culinary products are offered via an ancestral kitchen composed of the tulpa (fire pit) and brick oven in addition to a modern kitchen _ including cooking techniques for beginner and intermediate cooks to advanced chefs. Allow Claudia and her family to prepare their recipes, give demonstrative and interactive classes, and end the workshop by enjoying the dishes you’ve made together.",
                "previous": "We continue our tour with a Gastronomic experience!",
                "next": ""
              },
              {
                "experience_id": "5",
                "title": "Nayia Art Workshop ",
                "photo": "photo",
                "description": "The origin of dream catchers is known to be North American, although the art form currently extends from North America to the south of Chile. However, in Ecuador, objects very similar to the original dream catcher have been found hung in ancient houses thus indicating prior cultural exchanges between the Eagle (North American natives) and the Condor (South American natives). Meander through an outdoor exhibition of dream catchers of various sizes and designs to an indoor showroom and workshop. Discover the implication of harnessing the positive energies of the Pacha Mama or Mother Earth through the natural materials used to construct each of these amulets.",
                "previous": "After such amazing lunch we will visit another major community, Peguche, very well known for its Waterfall, a sacred place of purification of the soul.",
                "next": ""
              },
              {
                "experience_id": "6",
                "title": "Taita Gundo  ",
                "photo": "photo",
                "description": "Taita Gundo is a family project directed by the prestigious musician Ali Lema that was born from the need to rescue the construction, elaboration and interpretation of musical instruments of the Andes such as pingullos, dulzainas, quenas, quenachos, quenillas, rondadores, pallas, sikuris, as well as antaras and zampoñas which are especially representative of the Imbabura province. Located in Peguche, the community most famous for its art and manufacturing of instruments, all visitors are offered a wide sample of musical instruments and rhythms that identify the Kichwa peoples. As an expansion to the project, they maintain a permanent school of construction and interpretation of wind and string instruments that participates regularly at local and national events. Taita Gundo is presented to national and international tourists as a center of interpretation of musical art where the visitor can not only enter and enjoy the music, but reflect on the Andean cosmovision and what surrounds it.",
                "previous": "Next, be delighted with stories and legends told through Andean instruments! ",
                "next": ""
              },
              {
                "experience_id": "7",
                "title": "Diner on Saranse Restaurant",
                "photo": "photo",
                "description": "",
                "previous": "Let’s head back and enjoy a three_course dinner at our Sarance restaurant.",
                "next": ""
              }
            ]
          },
          {
            "parent": 2,
            "day_description": "After a hearty breakfast we will take you trekking to a unique place between mountains and beautiful lagoons. Enjoy a delicious picnic with a breathtaking view in the middle of the Andes. After great day we will go back to the hotel and in the evening we will visit a traditional restaurant in the city and have a three course meal.",
            "day_name": "Day 3",
            "date": "WENESDAY 27TH April 2022",
            "meals": "B/L/D/O",
            "option_id": "1",
            "day_observation": "Day 3: Overnight at Hotel Otavalo",
            "key_activity_id": "1",
            "description": "",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "8",
                "title": "Picnic with a breathtaking view in the middle of the Andes",
                "photo": "photo",
                "description": "After a hearty breakfast, we will take you trekking to a unique place between mountains and beautiful lagoons. Enjoy a delicious picnic with a breathtaking view in the middle of the Andes. ",
                "previous": "Let’s head back and enjoy a three_course dinner at our Sarance restaurant.",
                "next": ""
              },
              {
                "experience_id": "9",
                "title": "Lunch on Saranse Restaurant",
                "photo": "photo",
                "description": "",
                "previous": "After great day we will go back to the hotel and in the evening we will visit a traditional restaurant in the city and have a three course meal.",
                "next": ""
              }
            ]
          },
          {
            "parent": 3,
            "day_description": "After our breakfast the Hotel's Concierge will invite us to discover Otavalo in a different way. ",
            "day_name": "Day 4",
            "date": "THURSDAY 28TH April 2022",
            "meals": "B/L/D/O",
            "option_id": "1",
            "day_observation": "Day 4: Dinner at La Plaza Restaurant in the hotel.",
            "key_activity_id": "1",
            "description": "",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "10",
                "title": "Insiders Concierge Tour ",
                "photo": "photo",
                "description": "During this tour, we will learn about Otavalo's history, beliefs, traditions and legends. Visiting the old places with a deep understanding into the culture of Otavalo seen through the eyes of locals. Our concierges themselves, have lived the stories you will hear, giving you a better insight of iconic places in the city, which by the way, are not very touristic.",
                "previous": "After our breakfast the Hotel's Concierge will invite us to discover Otavalo in a different way",
                "next": ""
              }
            ]
          }
        ]
      },
      {
        "parent": 1,
        "destination_id": "2",
        "destination_name": "quito",
        "destination_title": "Quito",
        "description": "",
        "hotel_id": "1",
        "airport_id": "1",
        "has_aiport": false,
        "previous": "After this tour we will continue our trip to Quito making a lunch stop in one traditional Hacienda between the province of Imbabura and Pichincha. ",
        "next": "",
        "days": [
          {
            "parent": 4,
            "description": "After our breakfast the Hotel's Concierge will invite us to discover Otavalo in a different way. ",
            "day_name": "Day 4",
            "date": "THURSDAY 28TH April 2022",
            "meals": "B/L/D/O",
            "option_id": "1",
            "day_observation": "Day 4: Dinner at La Plaza Restaurant in the hotel.",
            "key_activity_id": "1",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "11",
                "title": "Hotel Mama Cuchara",
                "photo": "photo",
                "description": "Hotel Mama Cuchara in Quito’s old town will be waiting for you. Set in the traditional and one of the last living neighborhoods, La Loma Grande (“The Big Hill”), many generations of neighbors still live there, withholding hidden yet enchanting places you will enjoy.",
                "prevoius": "Have a good night sleep, you are going to need it.",
                "next": ""
              }
            ]
          },
          {
            "parent": 4,
            "description": "After our breakfast: we will start the day with our, Experiences",
            "day_name": "Day 5",
            "date": "THURSDAY 29TH April 2022",
            "meals": "B/L/D/O",
            "option_id": "1",
            "day_observation": "Day 5: Dinner at our “El Santo que da Marido” Rooftop Bar in Hotel Mama Cuchara",
            "key_activity_id": "1",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "12",
                "title": "The Domes of Santo Domingo Church and Chapel of the Rosary ",
                "photo": "photo",
                "description": "Located between the streets of Guayaquil and Rocafuerte the 16th century Church of Santo Domingo is a site that you should not miss. It was initially built by Dominican Priests, with contributions by various notable artists from Quito such as, Bernardo Legarda, Miguel de Santiago and Fray Pedro Bedón. Due to this fusion, the church has a large amount of Baroque as well as Neoclassical details, and a variety of artwork including sculptures and paintings which leave visitors in awe. The late 17th century Chapel of La Virgen del Rosario is located on one side of the church's central nave. Thus creating the famous arch of the Church of Santo Domingo, which supports the Chapel over Rocafuerte Street. In the chapel you can see the sculpture of the Virgin of the Rosary that was a gift from King Charles V of Spain to Quito. The decoration of this chapel conserves the pure essence of Baroque Quito – golden paintings and carvings on a red backdrop earn its consideration as one of the architectural gems of the historic center of Quito. Visiting the domes of this church is a worthy memory to take from your visit to Quito and the neighborhood of La Loma Grande. Be sure to bring your camera as you explore one of the best views of the old town! ",
                "previous": "",
                "next": "Still in the church…."
              },
              {
                "experience_id": "13",
                "title": "Library of Santo Domingo",
                "photo": "photo",
                "description": "Located between the streets of Guayaquil and Rocafuerte the 16th century Church of Santo Domingo is a site that you should not miss. It was initially built by Dominican Priests, with contributions by various notable artists from Quito such as, Bernardo Legarda, Miguel de Santiago and Fray Pedro Bedón. Due to this fusion, the church has a large amount of Baroque as well as Neoclassical details, and a variety of artwork including sculptures and paintings which leave visitors in awe. The late 17th century Chapel of La Virgen del Rosario is located on one side of the church's central nave. Thus creating the famous arch of the Church of Santo Domingo, which supports the Chapel over Rocafuerte Street. In the chapel you can see the sculpture of the Virgin of the Rosary that was a gift from King Charles V of Spain to Quito. The decoration of this chapel conserves the pure essence of Baroque Quito – golden paintings and carvings on a red backdrop earn its consideration as one of the architectural gems of the historic center of Quito. Visiting the domes of this church is a worthy memory to take from your visit to Quito and the neighborhood of La Loma Grande. Be sure to bring your camera as you explore one of the best views of the old town! ",
                "previous": "Tour the Hill of Enchantments. Starting with some religious musts.",
                "next": "After seeing such an incredible place, "
              },
              {
                "experience_id": "14",
                "title": "El Caretero",
                "photo": "photo",
                "description": "In La Loma Grande neighborhood discover a place as magical as the people who live and work in it. For more than two decades, El Caretero has been making beautiful handmade paper and cardboard masks which are representations of Ecuadorian popular culture. They are made with the same techniques of yesteryear, in clay molds and paste, which are then painted completely by hand. In addition, El Caretero of la Loma Grande exhibits a demonstration of skill when creating unique pieces by hand and invites you to participate in its creation. Discover and learn how his process is and let yourself be charmed by its art and tradition. ",
                "previous": "we have to meet an incredible human being, his passion will enchant you.",
                "next": "We will pause our tour in a traditional restaurant. In the afternoon we will be visiting the main churches and plazas in the old town. Enjoy an eloquent description of each site and its history. "
              }
            ]
          }
        ]
      },
      {
        "parent": 2,
        "destination_id": "3",
        "destination_name": "cuenca",
        "destination_title": "Cuenca",
        "description": "",
        "hotel_id": "1",
        "airport_id": "1",
        "has_aiport": false,
        "destination_previous": "you will be going to Next airport where you will connect into a local flight (if possible) to the beautiful city of Cuenca.  We will go to the emblematic Hotel .",
        "destination_next": "",
        "days": [
          {
            "parent": 5,
            "description": "",
            "transfer": "",
            "day_name": "Day 6",
            "date": "FRIDAY 30TH April 2022",
            "meals": "D/O",
            "option_id": "1",
            "day_observation": "Day 6: Dinner at Cupulas Azules restaurant of Hotel Cruz del Vado.",
            "day_next": "After breakfast, ",
            "day_previous": "",
            "key_activity_id": "1",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "15",
                "title": "Hotel Cruz del Vado",
                "photo": "photo",
                "description": "Hotel Cruz del Vado was always a building full of history, art and culture. Located in one of the first neighborhoods of the city and very close to the Cruz del Vado monument, the Hotel of the same name, was arduously intervened using a fusion of traditional and modern construction techniques, preserving the essence and history of this heritage building, while giving it our own identity.",
                "prevoius": "Have a good night sleep, you are going to need it.",
                "next": ""
              }
            ]
          },
          {
            "parent": 6,
            "description": "After breakfast we will be leaving to the Airport to take the flight to ",
            "transfer": "",
            "day_name": "Day 7",
            "date": "SATURDAY 1TH MAY 2022",
            "meals": "B/L/D/O",
            "option_id": "1",
            "day_observation": "Day 7: Dinner at a must restaurant in Cuenca",
            "key_activity_id": "1",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "17",
                "title": "The Blacksmith",
                "photo": "photo",
                "description": "The small traditional street that crosses “Las Herrerías” neighborhood, houses the workshop of Don Sergio Guerra, who, for more than 25 years, has been working in the traditional craft of the arts of fire. In his workshop, he shapes various pieces by hammer and anvil. The “Herrero” manufactures anything from antique style door locks to the coronation roosters of the traditional houses of Cuenca. Accompany him during his workday and he’ll even allow you to forge your own figure. Natural forms, padlocks, horseshoes and various handcrafted pieces take shape in his workshop, which is surely a place to be visited.",
                "previous": "with a one_of_a_kind view, you are going to be surprised by our exclusive tour in the city. Starting or ending in the oldest neighborhood right outside of the Hotel, you will explore what we like to call The Culture of El Vado. Cuenca is also known as the Cultural Capital of Ecuador, and “cuencanos” take this seriously. Explore with us the meticulous work made by skillful artisans. ",
                "next": "We will pause and eat in an emblematic traditional restaurant in the city to have energy for our next visit."
              },
              {
                "experience_id": "18",
                "title": "The Woodworker",
                "photo": "photo",
                "description": "At the entrance to this workshop, in the traditional neighborhood of Vado, you can find a unique aroma of wood. Here some of the most famous guitars in the country are manufactured. This craftsman tells us about his process, how he treats and works the wood to give it the shape of a guitar, charango or even a cuatro. The tuning is everything, some of their pieces take up to 6 months to complete, national and international artists commission the development of their instruments to this skillful instrument maker who embeds pieces of ivory and marble customized according to the taste of the artist who commissioned its development. Admiring this fine work and then listening to a melody from one of his creations is undoubtedly a sight worthy of applause.",
                "previous": "with a one_of_a_kind view, you are going to be surprised by our exclusive tour in the city. Starting or ending in the oldest neighborhood right outside of the Hotel, you will explore what we like to call The Culture of El Vado. Cuenca is also known as the Cultural Capital of Ecuador, and “cuencanos” take this seriously. Explore with us the meticulous work made by skillful artisans. ",
                "next": ""
              },
              {
                "experience_id": "19",
                "title": "The Antique Gallery",
                "photo": "photo",
                "description": "On La Condamine Street there is a private gallery, where you can recall history through the pieces on exhibit. The show is infinite: toys, cameras, saints and religious figures, instruments and many items that define eras and represent the way of life of the aristocracy of Cuenca in past times.",
                "previous": "Now some down time, exploring antiques of all sorts.",
                "next": ""
              },
              {
                "experience_id": "20",
                "title": "The Potter",
                "photo": "photo",
                "description": "For this family pottery is a way of life that has been passed down from generation to generation. Warmly opening the doors to their home_workshop, Don Juan tells you the story of how he has been practicing with clay since he was a child and that after more than 40 years he is just now perfecting his skills. In the workshop, located in La Convención district, unique pieces of clay are formed and then baked at thousands of degrees to obtain a unique black finish. The potter teaches you how to work the clay in his lathe to make all types of pots and the various pieces that are manufactured there.",
                "previous": "With energy recharged, we want you to use your hands and imagination for the next stop.",
                "next": ""
              }
            ]
          },
          {
            "parent": 7,
            "description": "After the breakfast we will be heading to the towns of Gualaceo and Chordeleg, known by their filigree shops, vibrant and colorful textiles and beautiful plazas. We will be having lunch at a traditional Restaurant while exploring the small towns.",
            "transfer": "",
            "day_name": "Day 8",
            "date": "SUNDAY 2TH MAY 2022",
            "meals": "B/L/D/O",
            "option_id": "1",
            "day_observation": "Day 8: Finally, our last dinner at your hotel, Hotel Cruz del Vado. A surprise will be provided.",
            "key_activity_id": "1",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "21",
                "title": "Shawls of Ikat",
                "photo": "photo",
                "description": "For centuries, an ancient technique of dyeing clothes called ikat has been practiced in Gualaceo. This technique consists of tying small strands of cabuya, a fiber of vegetable origin that comes from the fique plant (known locally as penco), in threads to draw patterns for what will later be a shawl. The more knots tied, the more complex and elaborate the process, which then, passes to the step of hand dying with leaves and fruits like walnut, to finally being woven by hand on a warp and becoming the famous shawl of Gualaceo. These shawls are of particular importance for being part of the traditional dress of the “Chola Cuencana”. There are shawls that take months to manufacture due to the complex process of elaboration. Learning from the hand of the artisans their techniques and processes is one of the most beautiful memories you can have in your visit to Cuenca.",
                "previous": "",
                "next": ""
              },
              {
                "experience_id": "22",
                "title": "Filigree",
                "photo": "photo",
                "description": "In a small and magical place south of Cuenca, some of the most elaborate pieces of jewelry in Ecuador are manufactured. Chordeleg, is recognized for being home to some of the best jewelers in the country. In this place, silver melts at thousands of degrees to form tiny braided threads that later give shape to chains, earrings, tiaras and crowns. The technique of these artisans is known as filigree and the jewelers of this small town have practiced it for generations. The impressive ability to weave small threads together into a jewel makes this an activity worthy of being admired, and the pieces produced here qualify as small pieces of art.",
                "previous": "",
                "next": ""
              }
            ]
          },
          {
            "parent": 8,
            "description": "",
            "transfer": "",
            "day_name": "Day 9",
            "date": "SATURDAY 3TH MAY 2022",
            "meals": "B/",
            "option_id": "1",
            "day_observation": "Day 9: Flight to Quito and final connection with international flight.",
            "key_activity_id": "1",
            "transport_id": "1",
            "props": "",
            "experiences": [
              {
                "experience_id": "23",
                "title": "Taking Pictures",
                "photo": "photo",
                "description": "Take one last picture of Cuenca while having breakfast, because you are going home. ",
                "previous": "",
                "next": ""
              }
            ]
          }
        ]
      }
    ]
  }